recipe = {"감자 짜글이":
              {"재료": ["감자", "양파", "대파", "청양고추", "고춧가루", "고추장", "간장", "스팸"],
               "레시피": ["1. 채소들을 썰어준다.", "2. 스팸을 으깨준다.", "3. 준비된 재료들을 냄비에 넣고 간장과 물을 넣는다.", "4. 골고루 섞어서 끓여준다."]},
          "대패삼겹 두부조림":
              {"재료": ["대패 삼겹살", "두부", "대파", "청양고추", "간장", "설탕", "고춧가루"],
               "레시피": ["1. 준비된 재료를 썬다.", "2. 냄비에 재료들을 담아준다", "3. 양념과 물을 넣고 조려준다."]},
          "오므라이스":
              {"재료": ["계란", "당근", "양파", "스팸", "대파", "밥"],
               "레시피": ["1. 준비된 재료들을 잘게 썰어준다.", "2. 대파를 볶아준다", "3. 나머지 채소도 넣어 볶아준다.", "4. 소금간을 한 뒤 밥을 넣어 볶아준다.",
                       "5. 계란을 부치고 볶아둔 밥을 넣고 말아준다."]},
          "볶음밥":
              {"재료": ["당근", "양파", "대파", "밥"],
               "레시피": ["1. 준비된 재료들을 잘게 썰어준다.", "2. 대파를 볶아준다", "3. 나머지 채소도 넣어 볶아준다.", "4. 소금간을 한 뒤 밥을 넣어 볶아준다."]}
          }